app/views/posts/show.html.erb


        <% unless @post.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 1], ["LIMIT", 1]]