app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hahah"], ["post_id", 1], ["created_at", "2024-04-22 03:15:18.036138"], ["updated_at", "2024-04-22 03:15:18.036138"], ["user_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])

    @comment = @post.comments.new(comment_params)

    @comment.user = current_user || nil

    @comment.save