app/controllers/main_controller.rb

    def index
        if session[:user_id]
            @vis = false
            @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]