app/controllers/passwords_controller.rb

  def create
    @user = User.find_by(email: params[:user][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "wtpadilhaa@gmail.com"], ["LIMIT", 1]]