app/controllers/posts_controller.rb

  def index
    @tags = Tag.all

    if params[:tag_id].present?
      @posts = Post.where(tag_id: params[:tag_id]).order(created_at: :desc).page params[:page]
    else
      @posts = Post.order(created_at: :desc).page params[:page]
---
SELECT "tags".* FROM "tags"
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]

  def show
    @post = Post.find(params[:id])
    @username = User.find_by(id: @post.user_id).username
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @post = Post.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @post = Post.new(post_params)
    @post.user = current_user
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "subtitle", "user_id", "tag_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "oi"], ["body", "testadndo 123"], ["created_at", "2024-04-22 03:15:10.233194"], ["updated_at", "2024-04-22 03:15:10.233194"], ["subtitle", "testtte"], ["user_id", 1], ["tag_id", 1]]

  def edit
    @post = Post.find(params[:id])
    @tags = Tag.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"

  def user_owner?
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]