app/controllers/users_controller.rb

  def create
    @user = User.create(user_params.except(:old_password))
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"